app/Controllers/Bismillah.php

SELECT *
FROM `tb_jenis`
---
  public function getAllJenis()
  {
    $data['data'] = array();
    $result = $this->jenis->select()->findAll();

SELECT *
FROM `tb_jenis`
WHERE `id_jenis` = '9'
 LIMIT 1
---
  public function getOneJenis()
  {
    $id = $this->request->getPost('id');

    if ($this->validation->check($id, 'required|numeric')) {

      $data = $this->jenis->where('id_jenis', $id)->first();