app/Models/AdminModel.php

UPDATE `tb_admin` SET `nama` = 'Kana Hashimoto', `email` = 'a@gmail.com', `periode` = '2023-2024'
WHERE `tb_admin`.`id_admin` IN ('3')
---
    public function updateUser($id, $update)
    {
        return $this->update(['id_admin' => $id], $update);

UPDATE `tb_admin` SET `pass` = '12345'
WHERE `tb_admin`.`id_admin` IN ('3')
---
    public function updatePassword($id, $update)
    {
        return $this->update(['id_admin' => $id], $update);