app/Models/JenisModel.php

    public function createJenis($save)
    {
        return $this->db->table('tb_jenis')->insert($save);
---
INSERT INTO `tb_jenis` (`jenis`) VALUES ('Hutang')

    public function updateJenis($id, $update)
    {
        return $this->update(['id_jenis' => $id], $update);
---
UPDATE `tb_jenis` SET `jenis` = 'Hutang a'
WHERE `tb_jenis`.`id_jenis` IN ('9')

    public function deleteJenis($id)
    {
        return $this->delete(['id_jenis' => $id]);
---
DELETE FROM `tb_jenis`
WHERE `id_jenis` IN ('9')