app/Models/KategoriModel.php

SELECT *
FROM `tb_kategori`
JOIN `tb_jenis` ON `tb_jenis`.`id_jenis` = `tb_kategori`.`jenis_id`
---
    public function allKategori()
    {
        $getData = $this->db->table('tb_kategori');
        $getData->join('tb_jenis', 'tb_jenis.id_jenis = tb_kategori.jenis_id');
        $query = $getData->get();